Tekla.Structures.Drawing.SizeDefinitionMode
Controls the size definition mode of the drawing sheet. Set the mode to
SizeDefinitionMode.SpecifiedSize if you want to force the sheet to a
certain size.
Tekla.Structures.Drawing.LayoutAttributes

Tekla.Structures.Drawing.SizeDefinitionMode.AutoSize
The smallest possible drawing sheet is automatically calculated.

Tekla.Structures.Drawing.SizeDefinitionMode.SpecifiedSize
Fixed values are used to control the sheet size.